#include <stdio.h>
#include <stdlib.h>

#define M 10 // 問題では小文字mとなっているがここでは大文字Mで表す



// 問題(1)
/* getdiag: 書き換え前のデータが保存されたm x mの整数型の２次元配列aとある長方形領域の
 *          代表要素a[i1][j1]の添字i1,j1を受け取り、その長方形領域の対角要素a[i2][j2]を求め
 *          整数型の配列dの0番目にi2,1番目にj2を格納する
 */
void getdiag(int a[][M], int i1, int j1, int d[2]) {
    while ((i1 < M) && (a[++i1][j1] != 0));             // 右方向に進む
    i1--;
    while ((j1 < M) && (a[i1][++j1] != 0));             // 下方向に進む
    j1--;

    d[0] = i1, d[1] = j1;
}


// 問題(2)
/* setc: 書き換え前のデータが格納されたm x mの整数型の２次元配列とある長方形領域の代表要素
 *       a[i][j]の添字i,jと整数cを受け取り、その長方形領域を表す要素の値をcに書き換える
 */
void setc(int a[][M], int i, int j, int c) {
    int x, y, d[2];

    getdiag(a, i, j, d);

    for(x=i; x <= d[0]; x++) {
        for (y=j; y <= d[1]; y++) {
            a[x][y] = c;
        }
    }
}


// 問題(3)
/* setcall: n個の長方形領域の書き換え前のデータが格納されたm x mの整数型の２次元配列aを受け取り
 *          長方形領域を表す要素の値を長方形領域ごとに異なる整数1,2,...,nで書き換えて
 *          長方形領域の個数を返す
 */
int setcall(int a[][M]) {
    int i, j, c;

    c=1;                                            // 書き換える正方領域の番号
    for (i=0; i < M; i++) {
        for (j=0; j < M; j++) {
            if (a[i][j] == -1) {
                setc(a, i, j, c);
                c++;
            }
        }
    }
    return c-1;
}


// 問題(4)
/* hist: 書き換え後のデータが格納されたm x mの整数型の２次元配列aと長方形領域の個数nを受け取り
 *       配列aの要素のうち、値が0,1,2,...,nであるものの数を整数型の配列bの0番目の要素,2番目の
 *       要素,...,n番目の要素にそれぞれ格納する
 */
void hist(int a[][M], int n, int *b) {
    int i, j;
    int c, sum;
    int d[2];

    c=1, sum=0;
    for (i=0; i < M; i++) {
        for (j=0; j < M; j++) {
            if (a[i][j] == c) {                     // 要素がcであるものが見つかった
                getdiag(a, i, j, d);
                b[c] = (d[0]-i+1) * (d[1]-j+1);
                sum += b[c];                        // 0以外の要素数を数える
                c++, i=-1;                          // 再び２次元配列の先頭から探索するためにiに-1を格納
                break;
            }
        }
    }
    b[0] = M*M-sum;                                 // 0の要素数を格納
}




/*************************************************************************************/
/*                                                                                   */
/*                               以下はテストコード                                  */
/*                                                                                   */
/*************************************************************************************/


void getdiag_test();
void setc_test();
void setcall_test();
void hist_test();


int main(int argc, char **argv) {
    getdiag_test();
    setcall_test();
    hist_test();
    return 0;
}


void getdiag_test() {
    int a[M][M] = {
         0,  0, -1, -1, -1,  0,  0,  0, -1, -1,
         0,  0, -1, -1, -1,  0,  0,  0,  0,  0,
        -1,  0, -1, -1, -1,  0, -1, -1,  0,  0,
        -1,  0,  0,  0,  0,  0, -1, -1,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0, -1, -1,
         0,  0,  0,  0,  0,  0,  0,  0, -1, -1,
         0, -1, -1, -1, -1, -1, -1, -1,  0,  0,
         0, -1, -1, -1, -1, -1, -1, -1,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  0, -1
    };
    int d[2] = { 0 };

    printf("getdiag() test: ");
    getdiag(a, 0, 2, d);
    if ((d[0] != 2) && (d[1] != 4)) {
        printf("FAIL\n");
        exit(1);
    }
    getdiag(a, 9, 9, d);
    if ((d[0] != 9) && (d[1] != 9)) {
        printf("FAIL\n");
        exit(1);
    }
    getdiag(a, 2, 0, d);
    if ((d[0] != 3) && (d[1] != 0)) {
        printf("FAIL\n");
        exit(1);
    }
    printf("OK\n");
}

void setc_test() {
}

void setcall_test() {
    int a[M][M] = {
         0,  0, -1, -1, -1,  0,  0,  0, -1, -1,
         0,  0, -1, -1, -1,  0,  0,  0,  0,  0,
        -1,  0, -1, -1, -1,  0, -1, -1,  0,  0,
        -1,  0,  0,  0,  0,  0, -1, -1,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0, -1, -1,
         0,  0,  0,  0,  0,  0,  0,  0, -1, -1,
         0, -1, -1, -1, -1, -1, -1, -1,  0,  0,
         0, -1, -1, -1, -1, -1, -1, -1,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  0, -1
    };
    int b[M][M] = {
         0,  0,  1,  1,  1,  0,  0,  0,  2,  2,
         0,  0,  1,  1,  1,  0,  0,  0,  0,  0,
         3,  0,  1,  1,  1,  0,  4,  4,  0,  0,
         3,  0,  0,  0,  0,  0,  4,  4,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  5,  5,
         0,  0,  0,  0,  0,  0,  0,  0,  5,  5,
         0,  6,  6,  6,  6,  6,  6,  6,  0,  0,
         0,  6,  6,  6,  6,  6,  6,  6,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  0,  7
    };
    int i, j, d[2] = { 0 };

    printf("setcall() test: ");
    setcall(a);
    for (i=0; i < M; i++) {
        for (j=0; j < M; j++) {
            if (a[i][j] != b[i][j]) {
                printf("FAIL\n");
                exit(1);
            }
        }
    }
    printf("OK\n");
}

void hist_test() {
    int b[M][M] = {
         0,  0,  1,  1,  1,  0,  0,  0,  2,  2,
         0,  0,  1,  1,  1,  0,  0,  0,  0,  0,
         3,  0,  1,  1,  1,  0,  4,  4,  0,  0,
         3,  0,  0,  0,  0,  0,  4,  4,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  5,  5,
         0,  0,  0,  0,  0,  0,  0,  0,  5,  5,
         0,  6,  6,  6,  6,  6,  6,  6,  0,  0,
         0,  6,  6,  6,  6,  6,  6,  6,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  0,  0,
         0,  0,  0,  0,  0,  0,  0,  0,  0,  7
    };
    int h[10] = { 0 };
    int i, j, d[2] = { 0 };
    int chk[8] = { 64, 9, 2, 2, 4, 4, 14, 1 };

    printf("hist() test:    ");
    hist(b, 7, h);

    for (i=0; i < 8; i++) {
        if (h[i] != chk[i]) {
            printf("FAIL\n");
            exit(1);
        }
    }
    printf("OK\n");
}
