#include <stdio.h>
#include <stdlib.h>

#define n 10                          // 問題で与えられている定数

// 問題(1)
/* sumrow: 行列が格納されているn x nの整数型の２次元配列Aと行の番号i(0 <= i <= n)を
 *         受け取り, 配列Aのi行目の要素の和を返す
 */
int sumrow(int A[][n], int i) {
    int j, sum;

    sum = 0;
    for (j=0; j < n; j++) {
        sum += A[i][j];
    }
    return sum;
}


// 問題(2)
/* sumcol: 行列が格納されているn x nの整数型の２次元配列Aと列の番号j(0 <= j <= n)を
 *         受け取り, 配列Aのj列目の要素の和を返す
 */
int sumcol(int A[][n], int j) {
    int i, sum;
    
    sum = 0;
    for (i=0; i < n; i++) {
        sum += A[i][j];
    }
    return sum;
}


// 問題(3)
/* sumdiag: 行列が格納されているn x nの整数型の２次元配列Aと要素数が2の整数型の配列bを
 *          受け取り, 配列Aの２つの対角線上の要素の和をb[0],b[1]に格納する
 *          b[0],b[1]にはそれぞれ右下がり, 右上がりの対角線上の要素の和を格納する
 */
void sumdiag(int A[][n], int b[2]) {
    int i;
    for (i=0; i < n; i++) {
        b[0] += A[i][i];
        b[1] += A[i][n-(i+1)];
    }
}


// 問題(4)
/* histo: 行列が格納されているn x nの整数型の２次元配列Aと要素数がn+1の整数型の配列hを
 *        受け取り, 配列Aの各行, 各列, ２つの対角線上の要素の和sの個数をh[s]に格納する
 */
void histo(int A[][n], int *h) {
    int i, num;
    int d[2] = { 0 };

    for (i=0; i < n; i++) {
        num = sumrow(A, i);
        h[num]++;
        num = sumcol(A, i);
        h[num]++;
    }
    sumdiag(A, d);
    h[d[0]]++;
    h[d[1]]++;
}


// 問題(5)
/* n x nの整数型の２次元配列Aの各要素に０または１を読み込み, 各行, 各列,　２つの
 * 対角線上の要素の和を求め, 問題の図2(b)のように１行毎に和とそれがいくつずるあるかを
 * アスタリスクを用いて表示
 */
int main(int argc, char **argv) {
    int A[n][n];
    int h[n+1] = { 0 };
    int i, j;

    srand(2013);

    // Aの初期化
    for (i=0; i < n; i++) {
        for (j=0; j < n; j++) {
            A[i][j] = rand() % 2;
        }
    }

    histo(A, h);

    // hの各要素数だけ*を表示
    for (i=0; i < n+1; i++) {
        printf("%2d ", i);
        for (j=1; j <= h[i]; j++) {
            printf("* ");
        }
        putchar('\n');
    }
    return 0;
}


/*************************************************************************************/
/*                                                                                   */
/*                               以下はテストコード                                  */
/*                                                                                   */
/*************************************************************************************/


void sumrow_test() {
    int A[n][n] = {
        1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
        0, 1, 1, 0, 0, 1, 1, 0, 1, 1,
        0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
        1, 1, 1, 0, 0, 1, 1, 1, 1, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        0, 1, 0, 1, 0, 1, 0, 1, 0, 1,
        1, 0, 1, 1, 1, 1, 0, 0, 0, 0,
        1, 0, 1, 1, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 1, 0, 0, 0, 0
    };
    int sum[n] = {
        3, 6, 1, 8, 0, 10, 5, 5, 3, 1                // 各行の1の数
    };
    int i, num;

    printf("sumrow() test:  ");
    for (i=0; i < n; i++) {
        num = sumrow(A, i);
        if (num != sum[i]) {
            printf("FAIL\n");
            printf("num: %d, sum[%d]:%d\n", num, i, sum[i]);
            exit(1);
        }
    }
    printf("OK\n");
}


void sumcol_test() {
    int A[n][n] = {
        1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
        0, 1, 1, 0, 0, 1, 1, 0, 1, 1,
        0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
        1, 1, 1, 0, 0, 1, 1, 1, 1, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        0, 1, 0, 1, 0, 1, 0, 1, 0, 1,
        1, 0, 1, 1, 1, 1, 0, 0, 0, 0,
        1, 0, 1, 1, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 1, 0, 0, 0, 0
    };
    int sum[n] = {
        5, 4, 6, 4, 2, 7, 3, 3, 3, 5                // 各列の1の数
    };
    int i, num;

    printf("sumcol() test:  ");
    num = 0;
    for (i=0; i < n; i++) {
        num = sumcol(A, i);
        if (num != sum[i]) {
            printf("FAIL\n");
            printf("num: %d, sum[%d]: %d\n", num, i, sum[i]);
            exit(1);
        }
    }
    printf("OK\n");
}


void sumdiag_test() {
    int A[n][n] = {
        1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
        0, 1, 1, 0, 0, 1, 1, 0, 1, 1,
        0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
        1, 1, 1, 0, 0, 1, 1, 1, 1, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        0, 1, 0, 1, 0, 1, 0, 1, 0, 1,
        1, 0, 1, 1, 1, 1, 0, 0, 0, 0,
        1, 0, 1, 1, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 1, 0, 0, 0, 0
    };
    int ans[2] = { 4, 6 };
    int b[2] = { 0 };

    printf("sumdiag() test: ");
    sumdiag(A, b);
    if ((ans[0] != b[0]) || (ans[1] != b[1])) {
        printf("FAIL\n");
        exit(1);
    }
    printf("OK\n");
}


void histo_test() {
    int A[n][n] = {
        1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
        0, 1, 1, 0, 0, 1, 1, 0, 1, 1,
        0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
        1, 1, 1, 0, 0, 1, 1, 1, 1, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        0, 1, 0, 1, 0, 1, 0, 1, 0, 1,
        1, 0, 1, 1, 1, 1, 0, 0, 0, 0,
        1, 0, 1, 1, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 1, 0, 0, 0, 0
    };
    int ans[n+1] = {
        1, 2, 1, 5, 3, 4, 3, 1, 1, 0, 1
    };
    int h[n+1] = { 0 };
    int i;

    printf("histo() test:   ");
    histo(A, h);

    for (i=0; i <= n+1; i++) {
        if (ans[i] != h[i]) {
            printf("FAIL\n");
            exit(1);
        }
    }
    printf("OK\n");
}


/*
int main(int argc, char **argv) {
    sumrow_test();
    sumcol_test();
    sumdiag_test();
    histo_test();
    return 0;
}
*/
